IDEA Connection Link
ConnectionLink.TestConnection Method (Action<IIOMSettings, IDEAProgress>, String, List<Int32>, List<Int32>, List<Int32>, String)
 Test Connection
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public void TestConnection(
	Action<IIOMSettings, IDEAProgress> myCreateIOM,
	string countryCode,
	List<int> selNodes,
	List<int> selBeams,
	List<int> mergBeams,
	ref string testFile
)
Public Sub TestConnection (
	myCreateIOM As Action(Of IIOMSettings, IDEAProgress),
	countryCode As String,
	selNodes As List(Of Integer),
	selBeams As List(Of Integer),
	mergBeams As List(Of Integer),
	ByRef testFile As String
)
public:
void TestConnection(
	Action<IIOMSettings^, IDEAProgress^>^ myCreateIOM,
	String^ countryCode,
	List<int>^ selNodes,
	List<int>^ selBeams,
	List<int>^ mergBeams,
	String^% testFile
)
Parameters
myCreateIOM
Type: System.Action<IIOMSettings, IDEAProgress>
[Missing <param name="myCreateIOM"/> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.TestConnection(System.Action{IdeaRS.OpenModel.Message.IIOMSettings,IdeaRS.OpenModel.Message.IDEAProgress},System.String,System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{System.Int32},System.String@)"]
countryCode
Type: System.String
[Missing <param name="countryCode"/> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.TestConnection(System.Action{IdeaRS.OpenModel.Message.IIOMSettings,IdeaRS.OpenModel.Message.IDEAProgress},System.String,System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{System.Int32},System.String@)"]
selNodes
Type: System.Collections.Generic.List<Int32>
[Missing <param name="selNodes"/> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.TestConnection(System.Action{IdeaRS.OpenModel.Message.IIOMSettings,IdeaRS.OpenModel.Message.IDEAProgress},System.String,System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{System.Int32},System.String@)"]
selBeams
Type: System.Collections.Generic.List<Int32>
[Missing <param name="selBeams"/> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.TestConnection(System.Action{IdeaRS.OpenModel.Message.IIOMSettings,IdeaRS.OpenModel.Message.IDEAProgress},System.String,System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{System.Int32},System.String@)"]
mergBeams
Type: System.Collections.Generic.List<Int32>
[Missing <param name="mergBeams"/> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.TestConnection(System.Action{IdeaRS.OpenModel.Message.IIOMSettings,IdeaRS.OpenModel.Message.IDEAProgress},System.String,System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{System.Int32},System.String@)"]
testFile
Type: System.String
[Missing <param name="testFile"/> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.TestConnection(System.Action{IdeaRS.OpenModel.Message.IIOMSettings,IdeaRS.OpenModel.Message.IDEAProgress},System.String,System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{System.Int32},System.String@)"]
See Also
Reference
ConnectionLink Class
TestConnection Overload
IdeaRS.ConnectionLink Namespace